IDEA StatiCa Open Model
CoordSystem Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Coordinate system base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry3D.CoordSystem
 IdeaRS.OpenModel.Geometry3D.CoordSystemByPoint
 IdeaRS.OpenModel.Geometry3D.CoordSystemByVector
 IdeaRS.OpenModel.Geometry3D.CoordSystemByZup
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class CoordSystem : OpenObject
Public MustInherit Class CoordSystem
	Inherits OpenObject
public ref class CoordSystem abstract : public OpenObject
The CoordSystem type exposes the following members.
Constructors
Name | Description
CoordSystem
Initializes a new instance of the CoordSystem class
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace